RedditWLuke/app/controllers/subreddits_controller.rb

SELECT "subreddits".* FROM "subreddits"
---
  def index
    @subreddits = Subreddit.all

INSERT INTO "subreddits" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Favorite Subreddit"], ["description", "This is my favorite project\r\n"], ["user_id", 1], ["created_at", "2018-09-18 21:35:43.426283"], ["updated_at", "2018-09-18 21:35:43.426283"]]
---
  def create
    @subreddit = Subreddit.new(subreddit_params)
    @subreddit.user_id = current_user.id
    if @subreddit.save

SELECT  "subreddits".* FROM "subreddits" WHERE "subreddits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @subreddit = Subreddit.find(params[:id])